
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/haruguchi-yuma/aws-ecs-terraform/actions/runs/14288475614)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/712a534f-3aa8-4dd3-ad71-66ae738fb940/terraform-bin apply -auto-approve -input=false
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02a7999140cb7d46b]
aws_security_group.ecs: Refreshing state... [id=sg-0cf92546af3fca408]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-083b13fd8062f5801]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-01a98b100a9e90a27]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-00a371ec09c5c42c7]
aws_security_group.alb: Refreshing state... [id=sg-064f56ad0151fd4c4]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0c79b8ce30703dd14]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0683321158553d692]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0de12d0e72aff9d6a]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-08c4c6f0fdf563338]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-056447c0f16234a92]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-054620f453b63a8dd]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0cd033fa9e54ffeb8]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0ebdf5ff77b8d2269]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-4274032936]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0e7655c2afa897b05]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02ee760d8bf1079fa]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07102b0ebd9f490c1]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-054620f453b63a8dd1080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-07699eac2ec2333ab]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-036840bbfc61d3a71]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-084cb5bd4ae4d314c]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0a29804183b7a0528]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-04324b55eef143096]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0cd033fa9e54ffeb81080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0ebdf5ff77b8d22691080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = (known after apply)
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "go-simple-server-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-064f56ad0151fd4c4",
        ]
      + subnets                                                      = [
          + "subnet-0683321158553d692",
          + "subnet-08c4c6f0fdf563338",
        ]
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # aws_lb_listener.aws_listener will be created
  + resource "aws_lb_listener" "aws_listener" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "go-simple-server-target-group"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-02a7999140cb7d46b"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health_checks"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lb.alb: Creating...
aws_lb_target_group.target_group: Creating...
aws_lb_target_group.target_group: Creation complete after 3s [id=arn:aws:elasticloadbalancing:ap-northeast-1:710195278619:targetgroup/go-simple-server-target-group/3d6ca46497e5196e]
aws_lb.alb: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_lb.alb: Still creating... [2m10s elapsed]
aws_lb.alb: Still creating... [2m20s elapsed]
aws_lb.alb: Still creating... [2m30s elapsed]
aws_lb.alb: Still creating... [2m40s elapsed]
aws_lb.alb: Still creating... [2m50s elapsed]
aws_lb.alb: Still creating... [3m0s elapsed]
aws_lb.alb: Creation complete after 3m6s [id=arn:aws:elasticloadbalancing:ap-northeast-1:710195278619:loadbalancer/app/go-simple-server-alb/68fbded159ad586e]
aws_lb_listener.aws_listener: Creating...
aws_lb_listener.aws_listener: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:710195278619:listener/app/go-simple-server-alb/68fbded159ad586e/c74561e4509842a4]
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_lb_listener_rule.alb_listener_rule: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:710195278619:listener-rule/app/go-simple-server-alb/68fbded159ad586e/c74561e4509842a4/561bb86566bf54b8]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.
::debug::Terraform exited with code 0.
::debug::stdout: Acquiring state lock. This may take a few moments...%0Amodule.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02a7999140cb7d46b]%0Aaws_security_group.ecs: Refreshing state... [id=sg-0cf92546af3fca408]%0Amodule.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-083b13fd8062f5801]%0Amodule.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-01a98b100a9e90a27]%0Amodule.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-00a371ec09c5c42c7]%0Aaws_security_group.alb: Refreshing state... [id=sg-064f56ad0151fd4c4]%0Amodule.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0c79b8ce30703dd14]%0Amodule.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0683321158553d692]%0Amodule.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0de12d0e72aff9d6a]%0Amodule.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-08c4c6f0fdf563338]%0Amodule.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-056447c0f16234a92]%0Amodule.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-054620f453b63a8dd]%0Amodule.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0cd033fa9e54ffeb8]%0Amodule.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0ebdf5ff77b8d2269]%0Aaws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-4274032936]%0Amodule.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0e7655c2afa897b05]%0Amodule.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02ee760d8bf1079fa]%0Amodule.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07102b0ebd9f490c1]%0Amodule.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-054620f453b63a8dd1080289494]%0Amodule.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-07699eac2ec2333ab]%0Amodule.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-036840bbfc61d3a71]%0Amodule.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-084cb5bd4ae4d314c]%0Amodule.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0a29804183b7a0528]%0Amodule.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-04324b55eef143096]%0Amodule.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0cd033fa9e54ffeb81080289494]%0Amodule.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0ebdf5ff77b8d22691080289494]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_lb.alb will be created%0A  + resource "aws_lb" "alb" {%0A      + arn                                                          = (known after apply)%0A      + arn_suffix                                                   = (known after apply)%0A      + client_keep_alive                                            = 3600%0A      + desync_mitigation_mode                                       = "defensive"%0A      + dns_name                                                     = (known after apply)%0A      + drop_invalid_header_fields                                   = false%0A      + enable_deletion_protection                                   = false%0A      + enable_http2                                                 = true%0A      + enable_tls_version_and_cipher_suite_headers                  = false%0A      + enable_waf_fail_open                                         = false%0A      + enable_xff_client_port                                       = false%0A      + enable_zonal_shift                                           = false%0A      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)%0A      + id                                                           = (known after apply)%0A      + idle_timeout                                                 = 60%0A      + internal                                                     = (known after apply)%0A      + ip_address_type                                              = (known after apply)%0A      + load_balancer_type                                           = "application"%0A      + name                                                         = "go-simple-server-alb"%0A      + name_prefix                                                  = (known after apply)%0A      + preserve_host_header                                         = false%0A      + security_groups                                              = [%0A          + "sg-064f56ad0151fd4c4",%0A        ]%0A      + subnets                                                      = [%0A          + "subnet-0683321158553d692",%0A          + "subnet-08c4c6f0fdf563338",%0A        ]%0A      + tags_all                                                     = (known after apply)%0A      + vpc_id                                                       = (known after apply)%0A      + xff_header_processing_mode                                   = "append"%0A      + zone_id                                                      = (known after apply)%0A    }%0A%0A  # aws_lb_listener.aws_listener will be created%0A  + resource "aws_lb_listener" "aws_listener" {%0A      + arn                                                                   = (known after apply)%0A      + id                                                                    = (known after apply)%0A      + load_balancer_arn                                                     = (known after apply)%0A      + port                                                                  = 80%0A      + protocol                                                              = "HTTP"%0A      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)%0A      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)%0A      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)%0A      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)%0A      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)%0A      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)%0A      + routing_http_response_access_control_max_age_header_value             = (known after apply)%0A      + routing_http_response_content_security_policy_header_value            = (known after apply)%0A      + routing_http_response_server_enabled                                  = (known after apply)%0A      + routing_http_response_strict_transport_security_header_value          = (known after apply)%0A      + routing_http_response_x_content_type_options_header_value             = (known after apply)%0A      + routing_http_response_x_frame_options_header_value                    = (known after apply)%0A      + ssl_policy                                                            = (known after apply)%0A      + tags_all                                                              = (known after apply)%0A      + tcp_idle_timeout_seconds                                              = (known after apply)%0A%0A      + default_action {%0A          + order = (known after apply)%0A          + type  = "fixed-response"%0A%0A          + fixed_response {%0A              + content_type = "text/plain"%0A              + message_body = "Fixed response content"%0A              + status_code  = "200"%0A            }%0A        }%0A    }%0A%0A  # aws_lb_listener_rule.alb_listener_rule will be created%0A  + resource "aws_lb_listener_rule" "alb_listener_rule" {%0A      + arn          = (known after apply)%0A      + id           = (known after apply)%0A      + listener_arn = (known after apply)%0A      + priority     = (known after apply)%0A      + tags_all     = (known after apply)%0A%0A      + action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A%0A      + condition {%0A          + path_pattern {%0A              + values = [%0A                  + "*",%0A                ]%0A            }%0A        }%0A    }%0A%0A  # aws_lb_target_group.target_group will be created%0A  + resource "aws_lb_target_group" "target_group" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = (known after apply)%0A      + deregistration_delay               = "300"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancer_arns                 = (known after apply)%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + load_balancing_anomaly_mitigation  = (known after apply)%0A      + load_balancing_cross_zone_enabled  = (known after apply)%0A      + name                               = "go-simple-server-target-group"%0A      + name_prefix                        = (known after apply)%0A      + port                               = 8080%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags_all                           = (known after apply)%0A      + target_type                        = "ip"%0A      + vpc_id                             = "vpc-02a7999140cb7d46b"%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 3%0A          + interval            = 30%0A          + matcher             = (known after apply)%0A          + path                = "/health_checks"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = 5%0A          + unhealthy_threshold = 3%0A        }%0A    }%0A%0APlan: 4 to add, 0 to change, 0 to destroy.%0Aaws_lb.alb: Creating...%0Aaws_lb_target_group.target_group: Creating...%0Aaws_lb_target_group.target_group: Creation complete after 3s [id=arn:aws:elasticloadbalancing:ap-northeast-1:710195278619:targetgroup/go-simple-server-target-group/3d6ca46497e5196e]%0Aaws_lb.alb: Still creating... [10s elapsed]%0Aaws_lb.alb: Still creating... [20s elapsed]%0Aaws_lb.alb: Still creating... [30s elapsed]%0Aaws_lb.alb: Still creating... [40s elapsed]%0Aaws_lb.alb: Still creating... [50s elapsed]%0Aaws_lb.alb: Still creating... [1m0s elapsed]%0Aaws_lb.alb: Still creating... [1m10s elapsed]%0Aaws_lb.alb: Still creating... [1m20s elapsed]%0Aaws_lb.alb: Still creating... [1m30s elapsed]%0Aaws_lb.alb: Still creating... [1m40s elapsed]%0Aaws_lb.alb: Still creating... [1m50s elapsed]%0Aaws_lb.alb: Still creating... [2m0s elapsed]%0Aaws_lb.alb: Still creating... [2m10s elapsed]%0Aaws_lb.alb: Still creating... [2m20s elapsed]%0Aaws_lb.alb: Still creating... [2m30s elapsed]%0Aaws_lb.alb: Still creating... [2m40s elapsed]%0Aaws_lb.alb: Still creating... [2m50s elapsed]%0Aaws_lb.alb: Still creating... [3m0s elapsed]%0Aaws_lb.alb: Creation complete after 3m6s [id=arn:aws:elasticloadbalancing:ap-northeast-1:710195278619:loadbalancer/app/go-simple-server-alb/68fbded159ad586e]%0Aaws_lb_listener.aws_listener: Creating...%0Aaws_lb_listener.aws_listener: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:710195278619:listener/app/go-simple-server-alb/68fbded159ad586e/c74561e4509842a4]%0Aaws_lb_listener_rule.alb_listener_rule: Creating...%0Aaws_lb_listener_rule.alb_listener_rule: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:710195278619:listener-rule/app/go-simple-server-alb/68fbded159ad586e/c74561e4509842a4/561bb86566bf54b8]%0AReleasing state lock. This may take a few moments...%0A%0AApply complete! Resources: 4 added, 0 changed, 0 destroyed.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"72e95a237cb2c35f7dde2b230da1b662bdb94ea7","Vars":{},"WorkflowName":"Terraform"} -->